Xin-zimu/stm32f103-spi-light-ui/User/bsp_st7789.h
#ifndef __BSP_ST7789_H
#define __BSP_ST7789_H

#include "stm32f10x.h"

#define ST7789_WIDTH               240U    // 屏幕可见区域宽度
#define ST7789_HEIGHT              320U    // 屏幕可见区域高度
#define ST7789_X_OFFSET            0U      // 可见区域在控制器显存中的 X 偏移
#define ST7789_Y_OFFSET            0U      // 240x320 面板从显存第 0 行开始
#define ST7789_USE_CS              0U      // 七针模块没有 CS 引脚
#define ST7789_SPI_MODE            3U      // 当前屏幕实测使用 SPI Mode 3
#define ST7789_MADCTL_VALUE        0x00U   // 默认扫描方向和 RGB 顺序

#define ST7789_BLACK               0x0000U // RGB565 黑色
#define ST7789_WHITE               0xFFFFU // RGB565 白色
#define ST7789_RED                 0xF800U // RGB565 红色
#define ST7789_GREEN               0x07E0U // RGB565 绿色
#define ST7789_BLUE                0x001FU // RGB565 蓝色
#define ST7789_YELLOW              0xFFE0U // RGB565 黄色
#define ST7789_CYAN                0x07FFU // RGB565 青色
#define ST7789_MAGENTA             0xF81FU // RGB565 品红色

/* 保留旧颜色名称，避免后续恢复未参与当前构建的实验代码时立即失效。 */
#define ST7789_COLOR_BLACK         ST7789_BLACK
#define ST7789_COLOR_WHITE         ST7789_WHITE
#define ST7789_COLOR_RED           ST7789_RED
#define ST7789_COLOR_GREEN         ST7789_GREEN
#define ST7789_COLOR_BLUE          ST7789_BLUE

void ST7789_GPIO_Init(void);
void ST7789_SPI_Init(void);
void ST7789_WriteByte(uint8_t data);
void ST7789_WriteCmd(uint8_t cmd);
void ST7789_WriteData8(uint8_t data);
void ST7789_WriteData16(uint16_t data);
void ST7789_Reset(void);
void ST7789_Backlight_On(void);
void ST7789_Backlight_Off(void);
void ST7789_Init(void);
void ST7789_SetAddressWindow(
    uint16_t x0,
    uint16_t y0,
    uint16_t x1,
    uint16_t y1
);
void ST7789_Clear(uint16_t color);

#endif
